import "./secret.css";
function Secret() {
  return (
    <div className="secretPage">
      <p>
        אז נעים להכיר, אני אסי קריניץ, בן 29, גר בקרית חיים ביחד עם הבת זוג
        המדהימה שלי והכלב המתוק שלנו ♥ אני עוסק בתור מתכנת בבית תוכנה כבר 3
        שנים, תפקיד שאני אוהב מאוד, נהנה לעשות אותו, ללמוד כל הזמן דברים חדשים
        ולהתמודד עם קשיים שונים, אבל הכי אני אוהב להסתכל על פרוייקט שעשיתי או
        פיצ'ר שפיתחתי ופשוט להנות מהתוצאה.
      </p>

      <p>
        למה האתר הזה בכלל? האתר הזה מיועד בשביל להציג את עצמי ואת הפרוייקטים
        שלי, להראות בקטנה מי אני, מקווה שאצליח להעביר לכם את זה בצורה מיטבית (=
      </p>

      <p>
        אז כדאי שטיפה תכירו אותי נחזור קצת לילדות שלי... מגיל צעיר אהבתי מחשבים,
        אהבתי במיוחד לשחק במחשב, הייתי גיימר כבר מגיל קטן, תמיד ניסיתי להשתפר
        ולהיות הכי טוב בכל משחק, דבר שאני מנסה ליישם בחיים בכל יום - "אם אתה
        עושה משהו תעשה אותו הכי טוב שאתה יכול" אני מנסה להזכיר את זה לעצמי
        לעיתים קרובות.
      </p>
      <p>
        בצבא התגייסתי לחיל האוויר בתור לוחם הגנה אווירית במערכת הנשק פטריוט.
        <br></br>
        זו הייתה תקופה משמעותית בשבילי, למדתי המון, בעיקר על עצמי, אבל למדתי מזה
        לא לוותר לעצמי, למדתי מזה רעות, למדתי לעבוד בצוות, לדאוג לאחרים ועוד...
        <br></br>
        לאחר שלוש שנים השתחררתי בתור לוחם ויצאתי לאזרחת.
      </p>

      <p>
        איך שהשתחררתי טסתי לעשות עגלות באמריקה, מכרתי מחליקי שיער בפילדפליה
        שבפנסילבניה, נהנהתי מהחוויה אבל אחרי חודש הבנתי שזה לא אני ואחרי שטיילתי
        קצת בניו יורק חזרתי לארץ הקודש. קצת אחרי שחזרתי התחלתי לעבוד בתור מאבטח,
        הייתי שנתיים מאבטח במתקן משטרתי מסווג, ועוד כשנתיים בכלי יריה חיפה, ששם
        עבדתי עד שמצאתי עבודה בתור מתכנת, אבל רגע יש עוד זמן עד שזה יקרה...
      </p>
      <p>
        באותה תקופה חשבתי זמן ממושך מה אני רוצה לעשות בחיים? מה אני רוצה ללמוד?
        חשבתי על משהו שקשור למחשבים אבל לא ידעתי מה ואיפה...
        <br></br>
        אחרי הרבה מחשבות, בדיקות, התייעצויות, מצאתי משהו שהיה נראה לי מעולה,
        משלב את כל מה שרציתי וזה היה - הנדסאי תוכנה במכללת אורט ביאליק.
        <br></br>
        (אני לא בן אדם שלוקח החלטות גדולות בקלות ראש...)
      </p>
      <p>
        איך שהתחלתי את הלימודים אהבתי את זה, אהבתי לתכנת, אהבתי לפתח אתרים,
        אפילו בחלק מהמקצועות אהבתי ללמוד! על השבוע הראשון היינו צריכים לבחור
        נציג לכיתה, החלטתי לקחת את זה על עצמי מתוך מחשבה שאני אדאג לכיתה שלנו
        יותר טוב מכל אחד אחר, וכך היה, הייתי נציג הכיתה למהלך כל הלימודים. בשנה
        השלישית של הלימודים נבחרתי להשתתף בתוכנית מצויינות של המכללה, שמיועדת ל
        2-3 סטודנטים מצטיינים של הכיתה בכל מגמה. וגם בשנה השלישית זכיתי להתקבל
        לעבודה הראשונה שלי בתור מתכנת, אותה עבודה שאני עובד בה גם היום.
      </p>
      <p>
        והנה הגענו להווה תכף, וזה זמן טוב להגיד לכם תודה שהקדשתם את הזמן שלכם
        להכיר אותי קצת (: מקווה שאתם לא סובלים! מבטיח שלא נשאר עוד הרבה!
        <br></br>
        אחרי שהתקבלתי לעבודה בתור סטודנט שנה שלישית, לא ידעתי הרבה, יותר מזה אני
        אגיד לא ידעתי כמעט כלום, בקושי היה לי הבנה של איך אתר אמור לעבוד, מה
        ההבדל בין באקנד לפרונט? בקושי הבנתי, והחלק המצחיק זה שפשוט זרקו אותי
        למים העמוקים שאני לא יודע לשחות וזה היה קשה, בשלב מוקדם הבנתי שהמתכנת
        הבכיר בחברה לא מתכוון ללמד אותי, הבנתי שאני תלוי רק בעצמי.
      </p>
      <p>
        בעבודה שלי הטכנולוגיות שאנחנו משתמשים בהם הם:
        <br></br>
        Angular - Frontend
        <br></br>
        Asp.Net - Backend
        <br></br>
        SQL Server - Database
        <br></br>
        GitHub - Control Version
        <br></br>
        איך שהתחלתי את העבודה לקחתי קורס Angular ב - Udemy והתחלתי ללמוד לבד, זה
        לא היה קל לעשות את המשימות שנתנו לי אבל למזלי באותה תקופה ניכנס גם החבר
        הטוב ביותר של המתכנת -Chat GPT אז יצא שבעבודה אני נותן את ה - 200% אפילו
        שאני לא יודע כלום, ובבית אני יושב ולומד אנגולר כל יום. עם הזמן למדתי גם
        את שאר הטכנולוגיות, למדתי מקורסים שונים ועבודה מתמדת והיום אני במצב שאני
        יודע מעולה את כל הטכנולוגיות שציינתי למעלה.
      </p>
      <p>
        לפני כמה חודשים החלטתי שאני רוצה להעמיק את הידע שלי לא רק בתכנות אלה גם
        במחשבים, ונירשמתי לקורס טכנאי מחשבים במכללה למנהל בחיפה, כמו שאמרתי
        בהתחלה אני מאוד אוהב מחשבים ואני היום שמח להגיד שאני לא רק מתכנת אלה גם
        טכנאי מחשבים שמבין בחומרה של המחשב, במערכות הפעלה, בתקלות, ברשתות,
        ועוד...
      </p>
      <p>
        ועכשיו אני מסתכל קדימה, חושב מה יהיה האתגר הבא בשבילי? מקום שאוכל להמשיך
        להתקדם ולהתפתח, אם אהבתם את מה שקראתם, ואתם מרגישים שאוכל להשתלב אצלכם
        בתור מתכנת, אז אשמח לישמוע ממכם ולשוחח (=
      </p>
    </div>
  );
}

export default Secret;
