import "./Home.css";

function Home() {
  return (
    <div className="homeImage">
      <h1 className="title">אהלן! שמח שהגעתם לאתר שלי 👋</h1>

      <div className="intro-card">
        <p>
          אני <strong>אסי קריניץ</strong>, מפתח תוכנה במקצועי. כבר שלוש שנים
          שאני עובד בבית תוכנה בצפון הארץ בשם <strong>Go-Net</strong>, שם אנחנו
          מפתחים אתרים ומערכות מורכבות עבור מגוון לקוחות.
        </p>

        <p>
          מעבר לעולם התכנות, אני <strong>גיימר בנשמה</strong> 🎮 — מאז שאני זוכר
          את עצמי הייתי יושב מול המחשב, משחק, מתעניין, מפרק ובונה דברים רק כדי
          להבין איך הם עובדים. משם צמחה האהבה שלי לעולם המחשבים והתכנות.
        </p>

        <p>
          גם האתר שאתם רואים עכשיו הוא חלק מהמסע שלי — פרויקט אישי שבניתי
          בטכנולוגיה חדשה עבורי, <strong>React</strong>. זה פרויקט קטן בלי צד
          שרת או בסיס נתונים, אבל עם הרבה השקעה, סקרנות ורצון ללמוד. אתם יודעים
          מה? אני באמת נהנה מכל רגע! 😄
        </p>

        <p>
          את לימודי ההנדסאי סיימתי במכללת <strong>אורט קריית ביאליק</strong>, שם
          קיבלתי
          <strong> דיפלומה בהנדסאי תוכנה</strong>. מאוד אהבתי את הלימודים, את
          המרצים ואת החברים לכיתה. במהלך הלימודים שימשתי כנציג הכיתה והשתתפתי
          בתכנית יוקרתית –<strong> כיתת המצוינות</strong> של אורט קריית ביאליק.
        </p>

        <p>
          במהלך לימודיי ב<strong>מכללת אורט קריית ביאליק</strong> נבחרתי להשתתף
          בתכנית היוקרתית <strong>כיתת המצוינות</strong> — תכנית רשתית של מכללות
          אורט המיועדת לסטודנטים מצטיינים בעלי הישגים גבוהים במיוחד. זו הייתה
          חוויה מעצימה שנתנה לי כלים חשובים כמו עבודת צוות, ניהול זמן וחשיבה
          יצירתית — כלים שאני מיישם בעבודתי ובכלל.
        </p>

        <p>
          לפני כמה חודשים החלטתי ללמוד תחום נוסף שתמיד סיקרן אותי —{" "}
          <strong>טכנאות מחשבים</strong>. תמיד רציתי להבין לעומק איך המחשב עובד:
          איך לחבר, לפרק, להחליף חלקים ולתקן תקלות בעצמי. מתוך סקרנות אמיתית,
          נרשמתי לקורס במכללה למנהל בחיפה, ושם למדתי המון דברים חדשים ופרקטיים.
          היום אני לא רק מתכנת, אלא גם טכנאי מחשבים שמבין בחומרה, מערכות הפעלה
          ורשתות.
        </p>

        <p>
          בשגרה שלי אני עובד עם טכנולוגיות כמו
          <strong> Angular</strong>, <strong>ASP.NET</strong> ו־
          <strong>SQL Server</strong>, וגם מתנסה ב־<strong>Node.js</strong> ו־
          <strong>React</strong>. מעבר לטכנולוגיה עצמה, חשוב לי לעבוד בצוות טוב,
          לכתוב קוד נקי וברור, ולהמשיך להשתפר כל הזמן.
        </p>

        <p>
          חוץ מתכנות, אני אוהב ללמוד, ליצור ולשתף ידע. האתר הזה נבנה כדי לספר
          קצת על עצמי, להציג פרויקטים שבניתי, ואולי לפתוח דלת להזדמנויות חדשות.
        </p>

        <p>תודה שקפצתם לבקר 💫</p>
      </div>
    </div>
  );
}

export default Home;
